$(function() {
   var menuJson={
       niceFood : ['全部','代金券','甜点饮品','火锅','自助餐','小吃快餐','日韩料理',
               '西餐','聚餐宴请','烧烤烤肉','东北菜','川湘菜','江浙菜','香锅烤鱼','粤港菜','中式烧烤/烤串','西北菜','咖啡酒吧茶馆',
               '云贵菜','东南亚菜','海鲜素食','台湾/客家菜','创意菜汤/粥/炖菜','蒙餐','新疆菜','其他美食','京菜鲁菜'],
       hotel:['全部','温泉酒店','情侣酒店','经济型酒店','高端酒店','主题酒店','度假酒店/度假村','公寓型酒店','客栈','青年旅社',
           '低星酒店','高星酒店','特价酒店','海外酒店','公寓民宿','多人出行','品牌连锁'],
       visit:['全部','温泉','景点','主题公园','水上乐园','动植物园','海洋馆','短途游','直通车','展览馆','游船','酒景套餐',
           '滑雪','高空观景','攀登运动','真人CS','农家乐','密室逃脱','滑冰','骑马','单车出租','漂流','景点套餐'],
       ktv:['足疗按摩','洗浴/汗蒸','酒吧','密室逃脱','轰趴馆','茶馆',
               '私人影院','DIY手工坊','采摘/农家乐','网吧网咖','游乐游艺','VR','桌面游戏','真人CS','棋牌室','其他玩乐','KTV'],
       life:['衣物/皮具洗护','家政','搬家运输','送水','充值缴费',
               '服饰/鞋包养护','开锁换锁','居家维修','管道疏通','家电维修清洗', '电脑维修','手机维修','证件照/肖像摄影','照片冲印/图文文印',
               '商务服务/法律服务','文化传媒机构','成人用品/情趣用品'],
       plane:['国内机票','国际/港澳台机票','火车票'],
       banquet:['全部','场地布置','洋房婚宴','婚礼会所','特色餐厅','酒店','宴会厅'],
       shopping:['全部','本地购物','服饰鞋包','配镜','鲜花','数码家电','超市/便利店','珠宝饰品'],
       tour:['全部','境外游','机票/火车票','景点门票'],
       beautiful:['美发','美甲美睫','美容美体','医学美容','瑜伽舞蹈', '瘦身纤体','韩式定妆','祛痘','纹身','化妆品'],
       sport:['健身中心','武术场馆','游泳馆','羽毛球馆','溜冰场','射箭馆','篮球场','网球馆',
               '台球馆','乒乓球','足球场','高尔夫场','保龄球馆','体育场馆','马术场','壁球馆','更多运动'],
       child:['婴儿游泳','其它亲子游乐','早教中心','少儿英语','智力开发','托班/幼儿园','幼儿教育','其他幼儿教育','月子会所','产后恢复','妇幼医院','孕产用品','开奶催乳',
                   '月嫂','亲子购物','宝宝派对','亲子服务'],
       animal:['宠物店','宠物医院'],
       car:['洗车','租车','加油站','维修保养','驾校','汽车美容','陪练','汽车用品','停车场',
           '汽车保险','4S店/汽车销售','更多汽车服务','机油保养','汽车报价','二手车','广告驾校','交警队','汽车改装','汽车配件'],
       photo:['儿童摄影','孕妇写真','上门拍','其他亲子摄影'],
       marry:['婚纱摄影','旅拍','个性写真','婚宴','婚庆公司','婚纱礼服','西服定制',
               '婚戒首饰','婚车租赁','司仪主持','彩妆造型','婚礼跟拍','婚礼小礼品','更多婚礼服务'],
       home:['半包装修','全包装修','清包装修','地板','瓷砖石材','橱柜','灯饰照明','厨卫洁具','油漆涂料','集成吊顶','墙纸墙艺',
                   '门窗','木材板材','家用五金','电工电料','楼梯','管材管件','家具','床上用品/家纺','家居饰品','厨具餐具','智能家居',
           '建材卖场','家居卖场','灯饰卖场'],
       study:['钢琴','吉他','小提琴','古筝','架子鼓','声乐','其他音乐培训','美容化妆','会计','IT','厨艺','管理培训','摄影培训','司法考试',
                   '公务员培训','其他职业培训','英语','日语','韩语','法语','德语','汉语','俄语','西班牙语','其他外语','绘画','书法','其他美术'],
        abroad:['全部','美食','当地玩乐','交通/用车','自由行','签证'],
       health:['医院','齿科口腔','体检中心','药店','中医','其他健康服务'],
       minsu:['上海','成都','北京','重庆','南京','杭州',
               '广州','西安','大连'],
       luckydraw:['全部','美梦成真','霸王餐','free游','丽人免单'],

       tuijian:['红旗厂','赛高街区','民乐园','西稍门','钟楼/鼓楼','明光路','城东客运站','曲江新区','电视塔','绿地世纪城','西北大/西工大',
            '科技路西口','东关正街','徐家庄','李家村'],
       beilin:['全部','东大街','南大街','钟楼/鼓楼','西北大/西工大','和平门/建国门','交大/理工大','南稍门','东关正街','立丰国际','太乙路',
           '长安立交','怡丰城/西荷花园','互助路','立交','李家村','朱雀大街北段','文艺路','黄雁村','劳动南路','广济街'],
       yanta:['全部','小寨','高新路','电子城','曲江新区','大雁塔','朱雀大街南段','南二环西段','南二环东段','明德门','雁翔路','西影路','电视塔',
           '含光路南段','政法/师大','吉祥村'],
       gaoxin:['全部','光华路','科技路西口','唐延路南段','大寨路','唐延路北段','绿地世纪城','西万路口','枫林绿洲','徐家庄','高新软件园','玫瑰大楼'],
       lianhu:['全部','劳动公园','丰庆公园','北关正街','汉城路沿线','莲湖公园','西大街','北大街西稍门','劳动南路土门','大兴新区','红庙坡'],
       weiyang:['全部','未央路','朱宏路','明光路','文景路','太华路','龙首村','大明宫','赛高街区','城市运动公园','辛家庙','北大学城','大明宫',
           '万达红旗厂','三桥和平村','西安北站'],
       xincheng:['全部','新城广场','民乐园','解放路/火车站','互助立交','胡家庙','金花路','韩森寨','东大街','矿山路','大明宫遗址公园','建工路'],
       baqiao:['全部','纺织城','十里铺','白鹿原','浐灞半岛/世园会','田洪正街','城东客运站','灞桥火车站','长乐坡'],
       lingtong:['全部','兵马俑','人民路/文化路','华清宫','东三岔','芷阳湖'],
       changan:['全部','秦岭沿线','长安广场','郭杜','南大学城','三森','紫薇田园都市','韦曲西街','韦曲南站','航天城'],
       gaoling:['全部','高陵县城','车城花园','马家湾'],
       yanliang:['全部','前进路','千禧广场','润天大道','凤凰广场','蓝天广场'],
       lantian:['全部','向阳路','北环路','汤峪镇'],
       zhouzhi:['全部','周至汽车站','武商购物广场'],
       yi:['全部','娄敬路','草堂路','余下镇','人民路']

   }
    $('li.hover').hover(function() {
        var self = this;
        var index=$(self).index();
        var menuTitle = $(self).attr('menuTitle');
        var menuObj = menuJson[menuTitle];
        var html = '';
        var startHtml = '<ul class="invisible-menu">';
        var endHtml = '<li class="last"></li></ul>';
        var childHtml = '';
        for (var i = 0; i < menuObj.length; i++) {
            var childHtmlItem = '<li>' + '<a href="#">' + menuObj[i] + '</a>' + '</li>';
            childHtml += childHtmlItem;
        }
        var itemHtml = startHtml + childHtml + endHtml;
        html += itemHtml;
        if($(self).find('ul.invisible-menu').length==0) {
            // var parents=self.closest('li.hover');
            // $(".a-invisible .out").eq(index).append(html);
            $(self).find('.a-invisible .out').append(html);
        }
        // $(".a-invisible").eq(index).show();
        $(self).find('.a-invisible').show(500);
    },function() {
        var self = this;
        var index=$(self).index();
        // var parents=self.closest('li.hover');
        // $(".a-invisible").eq(index).hide();
        $(self).find('.a-invisible').hide();
    });

    $('li.hover span.new').click(function(){
        this.css({
            'color': '#fff',
            'background': '#13d1be',
            'border-radius':'100px',
            'padding': '3px 10px',
            'font-size': '14px'
        })

    });





});
